#Дано натуральное число. Выведите его последнюю цифру

number = int(input())


last_digit = number % 10

print( last_digit)