#Дано двузначное число. Найдите число десятков в нем.

number = int(input())


tens_digit = number // 10

print(tens_digit)